-- --------------------------------------------------------
-- 호스트:                          127.0.0.1
-- 서버 버전:                        11.1.2-MariaDB - mariadb.org binary distribution
-- 서버 OS:                        Win64
-- HeidiSQL 버전:                  12.6.0.6765
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

-- 테이블 데이터 tinylibrary.book:~11 rows (대략적) 내보내기
INSERT INTO `book` (`book_id`, `moddate`, `regdate`, `price`, `release_date`, `title`, `writer`) VALUES
	(1, '2023-11-24 23:19:51.013225', '2023-11-24 23:19:51.013225', 18000, '2015-09-01', 'Make : 라즈베리 파이 로봇', '볼프람 도낫'),
	(2, '2023-11-24 23:21:11.015527', '2023-11-24 23:21:11.015527', 33000, '2017-08-02', '안나 카레니나 - 더클래식 세계문학 스페셜 에디션', '레프 니콜라예비치 톨스토이'),
	(3, '2023-11-24 23:21:49.952531', '2023-11-24 23:21:49.952531', 12000, '2023-11-17', '동물 농장', '조지 오웰'),
	(4, '2023-11-24 23:22:21.532019', '2023-11-24 23:22:21.532019', 13000, '2023-11-17', '1984', '조지 오웰'),
	(5, '2023-11-24 23:22:52.615261', '2023-11-24 23:22:52.615261', 45000, '2023-11-29', '생물정보학을 위한 파이썬', '켄 유엔스 클라크'),
	(6, '2023-11-24 23:23:22.692442', '2023-11-24 23:23:22.692442', 38000, '2023-11-28', '빅 브리치: 세계를 놀라게 한 개인정보 유출사고', '닐 다스와니,마우디 엘바야디'),
	(7, '2023-11-24 23:24:22.018198', '2023-11-24 23:24:22.018198', 22000, '2023-11-30', '파이썬 인공지능 자율주행 자동차', '서민우'),
	(8, '2023-11-24 23:25:18.486817', '2023-11-24 23:25:18.486817', 18800, '2023-11-13', '토르콰토 타소', '요한 볼프강 폰 괴테'),
	(9, '2023-11-24 23:26:17.177458', '2023-11-24 23:26:17.177458', 35000, '2023-12-01', '코드로 배우는 리액트', '구멍가게 코딩단'),
	(11, '2023-11-24 23:27:14.424873', '2023-11-24 23:27:14.424873', 42000, '2023-11-09', '파이썬 텍스트 마이닝 바이블 1', '이상엽'),
	(13, '2023-11-25 20:34:24.577700', '2023-11-25 20:34:24.577700', 34000, '2023-11-01', '코틀린 코루틴', '마르친 모스카와');

/*!40103 SET TIME_ZONE=IFNULL(@OLD_TIME_ZONE, 'system') */;
/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IFNULL(@OLD_FOREIGN_KEY_CHECKS, 1) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40111 SET SQL_NOTES=IFNULL(@OLD_SQL_NOTES, 1) */;
